cmsis-svd/cmsis-svd/data/Atmel/ATSAMV71Q21B.svd
            <register>
               <name>PMC_SLPWK_SR1</name>
               <description>SleepWalking Status Register 1</description>
               <addressOffset>0x013C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>PID32</name>
                     <description>Peripheral 32 SleepWalking Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID33</name>
                     <description>Peripheral 33 SleepWalking Status</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID34</name>
                     <description>Peripheral 34 SleepWalking Status</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID35</name>
                     <description>Peripheral 35 SleepWalking Status</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID37</name>
                     <description>Peripheral 37 SleepWalking Status</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID39</name>
                     <description>Peripheral 39 SleepWalking Status</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID40</name>
                     <description>Peripheral 40 SleepWalking Status</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID41</name>
                     <description>Peripheral 41 SleepWalking Status</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID42</name>
                     <description>Peripheral 42 SleepWalking Status</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID43</name>
                     <description>Peripheral 43 SleepWalking Status</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID44</name>
                     <description>Peripheral 44 SleepWalking Status</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID45</name>
                     <description>Peripheral 45 SleepWalking Status</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID46</name>
                     <description>Peripheral 46 SleepWalking Status</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID47</name>
                     <description>Peripheral 47 SleepWalking Status</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID48</name>
                     <description>Peripheral 48 SleepWalking Status</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID49</name>
                     <description>Peripheral 49 SleepWalking Status</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID50</name>
                     <description>Peripheral 50 SleepWalking Status</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID51</name>
                     <description>Peripheral 51 SleepWalking Status</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID52</name>
                     <description>Peripheral 52 SleepWalking Status</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID53</name>
                     <description>Peripheral 53 SleepWalking Status</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID56</name>
                     <description>Peripheral 56 SleepWalking Status</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID57</name>
                     <description>Peripheral 57 SleepWalking Status</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID58</name>
                     <description>Peripheral 58 SleepWalking Status</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID59</name>
                     <description>Peripheral 59 SleepWalking Status</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID60</name>
                     <description>Peripheral 60 SleepWalking Status</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PMC_SLPWK_ASR1</name>
               <description>SleepWalking Activity Status Register 1</description>
               <addressOffset>0x0140</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>PID32</name>
                     <description>Peripheral 32 Activity Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID33</name>
                     <description>Peripheral 33 Activity Status</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID34</name>
                     <description>Peripheral 34 Activity Status</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID35</name>
                     <description>Peripheral 35 Activity Status</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID37</name>
                     <description>Peripheral 37 Activity Status</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID39</name>
                     <description>Peripheral 39 Activity Status</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID40</name>
                     <description>Peripheral 40 Activity Status</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID41</name>
                     <description>Peripheral 41 Activity Status</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID42</name>
                     <description>Peripheral 42 Activity Status</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID43</name>
                     <description>Peripheral 43 Activity Status</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID44</name>
                     <description>Peripheral 44 Activity Status</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID45</name>
                     <description>Peripheral 45 Activity Status</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID46</name>
                     <description>Peripheral 46 Activity Status</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID47</name>
                     <description>Peripheral 47 Activity Status</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID48</name>
                     <description>Peripheral 48 Activity Status</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID49</name>
                     <description>Peripheral 49 Activity Status</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID50</name>
                     <description>Peripheral 50 Activity Status</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID51</name>
                     <description>Peripheral 51 Activity Status</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID52</name>
                     <description>Peripheral 52 Activity Status</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID53</name>
                     <description>Peripheral 53 Activity Status</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID56</name>
                     <description>Peripheral 56 Activity Status</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID57</name>
                     <description>Peripheral 57 Activity Status</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID58</name>
                     <description>Peripheral 58 Activity Status</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID59</name>
                     <description>Peripheral 59 Activity Status</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID60</name>
                     <description>Peripheral 60 Activity Status</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PMC_SLPWK_AIPR</name>
               <description>SleepWalking Activity In Progress Register</description>
               <addressOffset>0x0144</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>AIP</name>
                     <description>Activity In Progress</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
