cmsis-svd/cmsis-svd/data/Atmel/ATSAMV71Q21B.svd
            <register>
               <name>US_MR_USART_MODE</name>
               <description>Mode Register</description>
               <addressOffset>0x0004</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>USART_MODE</name>
                     <description>USART Mode of Operation</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>USART_MODESelect</name>
                        <enumeratedValue>
                           <name>NORMAL</name>
                           <description>Normal mode</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RS485</name>
                           <description>RS485</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HW_HANDSHAKING</name>
                           <description>Hardware handshaking</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MODEM</name>
                           <description>Modem</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IS07816_T_0</name>
                           <description>IS07816 Protocol: T = 0</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IS07816_T_1</name>
                           <description>IS07816 Protocol: T = 1</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IRDA</name>
                           <description>IrDA</description>
                           <value>0x8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LON</name>
                           <description>LON</description>
                           <value>0x9</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LIN_MASTER</name>
                           <description>LIN Master mode</description>
                           <value>0xA</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LIN_SLAVE</name>
                           <description>LIN Slave mode</description>
                           <value>0xB</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SPI_MASTER</name>
                           <description>SPI Master mode (CLKO must be written to 1 and USCLKS = 0, 1 or 2)</description>
                           <value>0xE</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SPI_SLAVE</name>
                           <description>SPI Slave mode</description>
                           <value>0xF</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>USCLKS</name>
                     <description>Clock Selection</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>USCLKSSelect</name>
                        <enumeratedValue>
                           <name>MCK</name>
                           <description>Peripheral clock is selected</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV</name>
                           <description>Peripheral clock divided (DIV = 8) is selected</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PCK</name>
                           <description>PMC programmable clock (PCK) is selected. If the SCK pin is driven (CLKO = 1), the CD field must be greater than 1.</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SCK</name>
                           <description>Serial clock (SCK) is selected</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CHRL</name>
                     <description>Character Length</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>CHRLSelect</name>
                        <enumeratedValue>
                           <name>_5_BIT</name>
                           <description>Character length is 5 bits</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_6_BIT</name>
                           <description>Character length is 6 bits</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_7_BIT</name>
                           <description>Character length is 7 bits</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_8_BIT</name>
                           <description>Character length is 8 bits</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SYNC</name>
                     <description>Synchronous Mode Select</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PAR</name>
                     <description>Parity Type</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>PARSelect</name>
                        <enumeratedValue>
                           <name>EVEN</name>
                           <description>Even parity</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ODD</name>
                           <description>Odd parity</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SPACE</name>
                           <description>Parity forced to 0 (Space)</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MARK</name>
                           <description>Parity forced to 1 (Mark)</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NO</name>
                           <description>No parity</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MULTIDROP</name>
                           <description>Multidrop mode</description>
                           <value>0x6</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>NBSTOP</name>
                     <description>Number of Stop Bits</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>NBSTOPSelect</name>
                        <enumeratedValue>
                           <name>_1_BIT</name>
                           <description>1 stop bit</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_1_5_BIT</name>
                           <description>1.5 stop bit (SYNC = 0) or reserved (SYNC = 1)</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_2_BIT</name>
                           <description>2 stop bits</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CHMODE</name>
                     <description>Channel Mode</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>CHMODESelect</name>
                        <enumeratedValue>
                           <name>NORMAL</name>
                           <description>Normal mode</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AUTOMATIC</name>
                           <description>Automatic Echo. Receiver input is connected to the TXD pin.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LOCAL_LOOPBACK</name>
                           <description>Local Loopback. Transmitter output is connected to the Receiver Input.</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REMOTE_LOOPBACK</name>
                           <description>Remote Loopback. RXD pin is internally connected to the TXD pin.</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MSBF</name>
                     <description>Bit Order</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MODE9</name>
                     <description>9-bit Character Length</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CLKO</name>
                     <description>Clock Output Select</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVER</name>
                     <description>Oversampling Mode</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>INACK</name>
                     <description>Inhibit Non Acknowledge</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DSNACK</name>
                     <description>Disable Successive NACK</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VAR_SYNC</name>
                     <description>Variable Synchronization of Command/Data Sync Start Frame Delimiter</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>INVDATA</name>
                     <description>Inverted Data</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MAX_ITERATION</name>
                     <description>Maximum Number of Automatic Iteration</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>FILTER</name>
                     <description>Receive Line Filter</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MAN</name>
                     <description>Manchester Encoder/Decoder Enable</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MODSYNC</name>
                     <description>Manchester Synchronization Mode</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ONEBIT</name>
                     <description>Start Frame Delimiter Selector</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>US_MR_SPI_MODE</name>
               <description>Mode Register</description>
               <alternateRegister>US_MR_USART_MODE</alternateRegister>
               <addressOffset>0x0004</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>USART_MODE</name>
                     <description>USART Mode of Operation</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>USART_MODESelect</name>
                        <enumeratedValue>
                           <name>NORMAL</name>
                           <description>Normal mode</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RS485</name>
                           <description>RS485</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HW_HANDSHAKING</name>
                           <description>Hardware handshaking</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MODEM</name>
                           <description>Modem</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IS07816_T_0</name>
                           <description>IS07816 Protocol: T = 0</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IS07816_T_1</name>
                           <description>IS07816 Protocol: T = 1</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IRDA</name>
                           <description>IrDA</description>
                           <value>0x8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LON</name>
                           <description>LON</description>
                           <value>0x9</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LIN_MASTER</name>
                           <description>LIN Master mode</description>
                           <value>0xA</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LIN_SLAVE</name>
                           <description>LIN Slave mode</description>
                           <value>0xB</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SPI_MASTER</name>
                           <description>SPI Master mode (CLKO must be written to 1 and USCLKS = 0, 1 or 2)</description>
                           <value>0xE</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SPI_SLAVE</name>
                           <description>SPI Slave mode</description>
                           <value>0xF</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>USCLKS</name>
                     <description>Clock Selection</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>USCLKSSelect</name>
                        <enumeratedValue>
                           <name>MCK</name>
                           <description>Peripheral clock is selected</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV</name>
                           <description>Peripheral clock divided (DIV = 8) is selected</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PCK</name>
                           <description>PMC programmable clock (PCK) is selected. If the SCK pin is driven (CLKO = 1), the CD field must be greater than 1.</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SCK</name>
                           <description>Serial clock (SCK) is selected</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CHRL</name>
                     <description>Character Length</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>CHRLSelect</name>
                        <enumeratedValue>
                           <name>_5_BIT</name>
                           <description>Character length is 5 bits</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_6_BIT</name>
                           <description>Character length is 6 bits</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_7_BIT</name>
                           <description>Character length is 7 bits</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_8_BIT</name>
                           <description>Character length is 8 bits</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CLKO</name>
                     <description>Clock Output Select</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CPHA</name>
                     <description>SPI Clock Phase</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CPOL</name>
                     <description>SPI Clock Polarity</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WRDBT</name>
                     <description>Wait Read Data Before Transfer</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
