cmsis-svd/cmsis-svd/data/Atmel/ATSAMV71Q21B.svd
            <register>
               <dim>10</dim>
               <dimIncrement>4</dimIncrement>
               <name>USBHS_HSTPIPISR_BLK_MODE[%s]</name>
               <description>Host Pipe Status Register</description>
               <alternateRegister>USBHS_HSTPIPISR_CTRL_MODE[%s]</alternateRegister>
               <addressOffset>0x530</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>RXINI</name>
                     <description>Received IN Data Interrupt</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXOUTI</name>
                     <description>Transmitted OUT Data Interrupt</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXSTPI</name>
                     <description>Transmitted SETUP Interrupt</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PERRI</name>
                     <description>Pipe Error Interrupt</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NAKEDI</name>
                     <description>NAKed Interrupt</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVERFI</name>
                     <description>Overflow Interrupt</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXSTALLDI</name>
                     <description>Received STALLed Interrupt</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SHORTPACKETI</name>
                     <description>Short Packet Interrupt</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DTSEQ</name>
                     <description>Data Toggle Sequence</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>DTSEQSelect</name>
                        <enumeratedValue>
                           <name>DATA0</name>
                           <description>Data0 toggle sequence</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DATA1</name>
                           <description>Data1 toggle sequence</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>NBUSYBK</name>
                     <description>Number of Busy Banks</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>NBUSYBKSelect</name>
                        <enumeratedValue>
                           <name>_0_BUSY</name>
                           <description>0 busy bank (all banks free)</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_1_BUSY</name>
                           <description>1 busy bank</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_2_BUSY</name>
                           <description>2 busy banks</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_3_BUSY</name>
                           <description>3 busy banks</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CURRBK</name>
                     <description>Current Bank</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>CURRBKSelect</name>
                        <enumeratedValue>
                           <name>BANK0</name>
                           <description>Current bank is bank0</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BANK1</name>
                           <description>Current bank is bank1</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BANK2</name>
                           <description>Current bank is bank2</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RWALL</name>
                     <description>Read/Write Allowed</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CFGOK</name>
                     <description>Configuration OK Status</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PBYCT</name>
                     <description>Pipe Byte Count</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>11</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>10</dim>
               <dimIncrement>4</dimIncrement>
               <name>USBHS_HSTPIPISR_INTRPT_MODE[%s]</name>
               <description>Host Pipe Status Register</description>
               <alternateRegister>USBHS_HSTPIPISR_CTRL_MODE[%s]</alternateRegister>
               <addressOffset>0x530</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>RXINI</name>
                     <description>Received IN Data Interrupt</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXOUTI</name>
                     <description>Transmitted OUT Data Interrupt</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UNDERFI</name>
                     <description>Underflow Interrupt</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PERRI</name>
                     <description>Pipe Error Interrupt</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NAKEDI</name>
                     <description>NAKed Interrupt</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVERFI</name>
                     <description>Overflow Interrupt</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXSTALLDI</name>
                     <description>Received STALLed Interrupt</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SHORTPACKETI</name>
                     <description>Short Packet Interrupt</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DTSEQ</name>
                     <description>Data Toggle Sequence</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>DTSEQSelect</name>
                        <enumeratedValue>
                           <name>DATA0</name>
                           <description>Data0 toggle sequence</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DATA1</name>
                           <description>Data1 toggle sequence</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>NBUSYBK</name>
                     <description>Number of Busy Banks</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>NBUSYBKSelect</name>
                        <enumeratedValue>
                           <name>_0_BUSY</name>
                           <description>0 busy bank (all banks free)</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_1_BUSY</name>
                           <description>1 busy bank</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_2_BUSY</name>
                           <description>2 busy banks</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_3_BUSY</name>
                           <description>3 busy banks</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CURRBK</name>
                     <description>Current Bank</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>CURRBKSelect</name>
                        <enumeratedValue>
                           <name>BANK0</name>
                           <description>Current bank is bank0</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BANK1</name>
                           <description>Current bank is bank1</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BANK2</name>
                           <description>Current bank is bank2</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RWALL</name>
                     <description>Read/Write Allowed</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CFGOK</name>
                     <description>Configuration OK Status</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PBYCT</name>
                     <description>Pipe Byte Count</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>11</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>10</dim>
               <dimIncrement>4</dimIncrement>
               <name>USBHS_HSTPIPICR_CTRL_MODE[%s]</name>
               <description>Host Pipe Clear Register</description>
               <addressOffset>0x560</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>RXINIC</name>
                     <description>Received IN Data Interrupt Clear</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXOUTIC</name>
                     <description>Transmitted OUT Data Interrupt Clear</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXSTPIC</name>
                     <description>Transmitted SETUP Interrupt Clear</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NAKEDIC</name>
                     <description>NAKed Interrupt Clear</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVERFIC</name>
                     <description>Overflow Interrupt Clear</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXSTALLDIC</name>
                     <description>Received STALLed Interrupt Clear</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SHORTPACKETIC</name>
                     <description>Short Packet Interrupt Clear</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>10</dim>
               <dimIncrement>4</dimIncrement>
               <name>USBHS_HSTPIPICR_ISO_MODE[%s]</name>
               <description>Host Pipe Clear Register</description>
               <alternateRegister>USBHS_HSTPIPICR_CTRL_MODE[%s]</alternateRegister>
               <addressOffset>0x560</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>RXINIC</name>
                     <description>Received IN Data Interrupt Clear</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXOUTIC</name>
                     <description>Transmitted OUT Data Interrupt Clear</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UNDERFIC</name>
                     <description>Underflow Interrupt Clear</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NAKEDIC</name>
                     <description>NAKed Interrupt Clear</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVERFIC</name>
                     <description>Overflow Interrupt Clear</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CRCERRIC</name>
                     <description>CRC Error Interrupt Clear</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SHORTPACKETIC</name>
                     <description>Short Packet Interrupt Clear</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>10</dim>
               <dimIncrement>4</dimIncrement>
               <name>USBHS_HSTPIPICR_BLK_MODE[%s]</name>
               <description>Host Pipe Clear Register</description>
               <alternateRegister>USBHS_HSTPIPICR_CTRL_MODE[%s]</alternateRegister>
               <addressOffset>0x560</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>RXINIC</name>
                     <description>Received IN Data Interrupt Clear</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXOUTIC</name>
                     <description>Transmitted OUT Data Interrupt Clear</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXSTPIC</name>
                     <description>Transmitted SETUP Interrupt Clear</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NAKEDIC</name>
                     <description>NAKed Interrupt Clear</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVERFIC</name>
                     <description>Overflow Interrupt Clear</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXSTALLDIC</name>
                     <description>Received STALLed Interrupt Clear</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SHORTPACKETIC</name>
                     <description>Short Packet Interrupt Clear</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>10</dim>
               <dimIncrement>4</dimIncrement>
               <name>USBHS_HSTPIPICR_INTRPT_MODE[%s]</name>
               <description>Host Pipe Clear Register</description>
               <alternateRegister>USBHS_HSTPIPICR_CTRL_MODE[%s]</alternateRegister>
               <addressOffset>0x560</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>RXINIC</name>
                     <description>Received IN Data Interrupt Clear</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXOUTIC</name>
                     <description>Transmitted OUT Data Interrupt Clear</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UNDERFIC</name>
                     <description>Underflow Interrupt Clear</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NAKEDIC</name>
                     <description>NAKed Interrupt Clear</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVERFIC</name>
                     <description>Overflow Interrupt Clear</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXSTALLDIC</name>
                     <description>Received STALLed Interrupt Clear</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SHORTPACKETIC</name>
                     <description>Short Packet Interrupt Clear</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
