cmsis-svd/cmsis-svd/data/Atmel/ATSAMV71Q21B.svd
                              <name>UART2_TX</name>
                              <description>UART2_TX</description>
                              <value>24</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>UART2_RX</name>
                              <description>UART2_RX</description>
                              <value>25</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>UART3_TX</name>
                              <description>UART3_TX</description>
                              <value>26</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>UART3_RX</name>
                              <description>UART3_RX</description>
                              <value>27</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>UART4_TX</name>
                              <description>UART4_TX</description>
                              <value>28</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>UART4_RX</name>
                              <description>UART4_RX</description>
                              <value>29</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>DACC0</name>
                              <description>DACC0</description>
                              <value>30</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>DACC1</name>
                              <description>DACC1</description>
                              <value>31</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SSC_TX</name>
                              <description>SSC_TX</description>
                              <value>32</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SSC_RX</name>
                              <description>SSC_RX</description>
                              <value>33</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PIOA</name>
                              <description>PIOA</description>
                              <value>34</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>AFEC0</name>
                              <description>AFEC0</description>
                              <value>35</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>AFEC1</name>
                              <description>AFEC1</description>
                              <value>36</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>AES_TX</name>
                              <description>AES_TX</description>
                              <value>37</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>AES_RX</name>
                              <description>AES_RX</description>
                              <value>38</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PWM1</name>
                              <description>PWM1</description>
                              <value>39</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TC0</name>
                              <description>TC0</description>
                              <value>40</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TC3</name>
                              <description>TC3</description>
                              <value>41</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TC6</name>
                              <description>TC6</description>
                              <value>42</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TC9</name>
                              <description>TC9</description>
                              <value>43</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>I2SC0_TX_LEFT</name>
                              <description>I2SC0_TX_LEFT</description>
                              <value>44</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>I2SC0_RX_LEFT</name>
                              <description>I2SC0_RX_LEFT</description>
                              <value>45</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>I2SC1_TX_LEFT</name>
                              <description>I2SC1_TX_LEFT</description>
                              <value>46</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>I2SC1_RX_LEFT</name>
                              <description>I2SC1_RX_LEFT</description>
                              <value>47</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>I2SC0_TX_RIGHT</name>
                              <description>I2SC0_TX_RIGHT</description>
                              <value>48</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>I2SC0_RX_RIGHT</name>
                              <description>I2SC0_RX_RIGHT</description>
                              <value>49</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>I2SC1_TX_RIGHT</name>
                              <description>I2SC1_TX_RIGHT</description>
                              <value>50</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>I2SC1_RX_RIGHT</name>
                              <description>I2SC1_RX_RIGHT</description>
                              <value>51</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>XDMAC_CDS_MSP</name>
                  <description>Channel Data Stride Memory Set Pattern</description>
                  <addressOffset>0x2C</addressOffset>
                  <size>32</size>
                  <fields>
                     <field>
                        <name>SDS_MSP</name>
                        <description>Channel x Source Data stride or Memory Set Pattern</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                     </field>
                     <field>
                        <name>DDS_MSP</name>
                        <description>Channel x Destination Data Stride or Memory Set Pattern</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>16</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>XDMAC_CSUS</name>
                  <description>Channel Source Microblock Stride</description>
                  <addressOffset>0x30</addressOffset>
                  <size>32</size>
                  <fields>
                     <field>
                        <name>SUBS</name>
                        <description>Channel x Source Microblock Stride</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>24</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>XDMAC_CDUS</name>
                  <description>Channel Destination Microblock Stride</description>
                  <addressOffset>0x34</addressOffset>
                  <size>32</size>
                  <fields>
                     <field>
                        <name>DUBS</name>
                        <description>Channel x Destination Microblock Stride</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>24</bitWidth>
                     </field>
                  </fields>
               </register>
            </cluster>
